Repository: YNS-JNS/plugin-quick-checkout
Catalog: languages/quick-checkout-popup-*.po
Languages: ar, fr_fr

source: <strong>%s</strong> requires WooCommerce to be installed and activated. Please install or activate WooCommerce.
ar: <strong>%s</strong> يتطلب تثبيت وتفعيل WooCommerce. يرجى تثبيت أو تفعيل WooCommerce.
fr_fr: <strong>%s</strong> nécessite que WooCommerce soit installé et activé. Veuillez installer ou activer WooCommerce.

source: Thank you for your order! We will contact you shortly.
ar: شكراً لطلبك! سوف نتصل بك قريباً.
fr_fr: Merci pour votre commande ! Nous vous contacterons sous peu.

source: This field is required.
ar: هذا الحقل مطلوب.
fr_fr: Ce champ est obligatoire.

source: Please enter a valid phone number.
ar: يرجى إدخال رقم هاتف صحيح.
fr_fr: Veuillez entrer un numéro de téléphone valide.

source: Please enter a valid number.
ar: يرجى إدخال رقم صحيح.
fr_fr: Veuillez entrer un nombre valide.

source: Quantity must be at least 1.
ar: يجب أن تكون الكمية 1 على الأقل.
fr_fr: La quantité doit être d'au moins 1.

source: Error applying coupon.
ar: خطأ في تطبيق الكوبون.
fr_fr: Erreur lors de l'application du coupon.

source: Coupon applied successfully.
ar: تم تطبيق الكوبون بنجاح.
fr_fr: Coupon appliqué avec succès.

source: Coupon removed.
ar: تمت إزالة الكوبون.
fr_fr: Coupon supprimé.

source: Please enter a coupon code.
ar: يرجى إدخال رمز الكوبون.
fr_fr: Veuillez entrer un code promo.

source: Apply
ar: تطبيق
fr_fr: Appliquer

source: Applying...
ar: جاري التطبيق...
fr_fr: Application...

source: Remove
ar: إزالة
fr_fr: Supprimer

source: Removing...
ar: جاري الإزالة...
fr_fr: Suppression...

source: Please select product options.
ar: يرجى تحديد خيارات المنتج.
fr_fr: Veuillez sélectionner les options du produit.

source: Sorry, this combination is unavailable.
ar: عذراً، هذه التشكيلة غير متوفرة.
fr_fr: Désolé, cette combinaison n'est pas disponible.

source: Sorry, this combination is out of stock.
ar: عذراً، هذه التشكيلة غير متوفرة في المخزون.
fr_fr: Désolé, cette combinaison est en rupture de stock.

source: Loading options...
ar: جاري تحميل الخيارات...
fr_fr: Chargement des options...

source: Options loaded.
ar: تم تحميل الخيارات.
fr_fr: Options chargées.

source: Select Variation
ar: اختر التشكيلة
fr_fr: Sélectionner la variation

source: Proceed to Checkout
ar: المتابعة للدفع
fr_fr: Passer à la caisse

source: Place Order
ar: إتمام الطلب
fr_fr: Commander

source: Total
ar: المجموع

source: Buy Now
ar: اشترِ الآن
fr_fr: Acheter maintenant

source: Select Options
ar: اختر الخيارات
fr_fr: Choisir les options

source: Quick Buy / Select Options
ar: شراء سريع / اختر الخيارات
fr_fr: Achat Rapide / Choisir les options

source: This product is currently unavailable.
ar: هذا المنتج غير متوفر حالياً.
fr_fr: Ce produit est actuellement indisponible.

source: Security check failed.
ar: فشل التحقق الأمني.
fr_fr: La vérification de sécurité a échoué.

source: Full Name
ar: الاسم الكامل
fr_fr: Nom complet

source: Phone Number
ar: رقم الهاتف
fr_fr: Numéro de téléphone

source: Town / City
ar: المدينة
fr_fr: Ville

source: Street Address
ar: عنوان الشارع
fr_fr: Adresse

source: %s is required.
ar: %s مطلوب.
fr_fr: %s est requis.

source: Invalid phone format.
ar: صيغة الهاتف غير صحيحة.
fr_fr: Format de téléphone invalide.

source: Invalid product data received.
ar: تم استلام بيانات منتج غير صالحة.
fr_fr: Données produit reçues invalides.

source: Product not found.
ar: المنتج غير موجود.
fr_fr: Produit non trouvé.

source: This product cannot be purchased at this time.
ar: لا يمكن شراء هذا المنتج في الوقت الحالي.
fr_fr: Ce produit ne peut pas être acheté pour le moment.

source: This product is currently out of stock.
ar: هذا المنتج غير متوفر حالياً في المخزون.
fr_fr: Ce produit est actuellement en rupture de stock.

source: Invalid product variation selected.
ar: تم تحديد تشكيلة منتج غير صالحة.
fr_fr: Variation de produit sélectionnée invalide.

source: Error validating product variation details.
ar: خطأ في التحقق من تفاصيل تشكيلة المنتج.
fr_fr: Erreur lors de la validation des détails de la variation produit.

source: Only %s available (variation).
ar: متوفر فقط %s (تشكيلة).
fr_fr: Seulement %s disponible(s) (variation).

source: Selected variation is out of stock.
ar: التشكيلة المحددة غير متوفرة في المخزون.
fr_fr: La variation sélectionnée est en rupture de stock.

source: Only %s available.
ar: متوفر فقط %s.
fr_fr: Seulement %s disponible(s).

source: Please select product options first.
ar: يرجى تحديد خيارات المنتج أولاً.
fr_fr: Veuillez d'abord sélectionner les options du produit.

source: This product type is not supported.
ar: نوع المنتج هذا غير مدعوم.
fr_fr: Ce type de produit n'est pas supporté.

source: Internal Error: Invalid product data.
ar: خطأ داخلي: بيانات المنتج غير صالحة.
fr_fr: Erreur interne : Données produit invalides.

source: Internal Error: Invalid variation data.
ar: خطأ داخلي: بيانات التشكيلة غير صالحة.
fr_fr: Erreur interne : Données de variation invalides.

source: Thank you! Order received.
ar: شكراً لك! تم استلام الطلب.
fr_fr: Merci ! Commande reçue.

source: Invalid product ID.
ar: معرف المنتج غير صالح.
fr_fr: ID produit invalide.

source: Product is not variable.
ar: المنتج ليس متغيراً.
fr_fr: Le produit n'est pas variable.

source: Error loading options.
ar: خطأ في تحميل الخيارات.
fr_fr: Erreur lors du chargement des options.

source: No variations available or error loading options.
ar: لا توجد تشكيلات متاحة أو خطأ في تحميل الخيارات.
fr_fr: Aucune variation disponible ou erreur lors du chargement des options.

source: Coupons disabled.
ar: الكوبونات معطلة.
fr_fr: Coupons désactivés.

source: Enter coupon code.
ar: أدخل رمز الكوبون.
fr_fr: Entrez un code promo.

source: Invalid or expired coupon.
ar: كوبون غير صالح أو منتهي الصلاحية.
fr_fr: Coupon invalide ou expiré.

source: Coupon not valid for product.
ar: الكوبون غير صالح لهذا المنتج.
fr_fr: Coupon non valide pour ce produit.

source: Min spend: %s.
ar: الحد الأدنى للإنفاق: %s.
fr_fr: Dépense min. : %s.

source: Max spend: %s.
ar: الحد الأقصى للإنفاق: %s.
fr_fr: Dépense max. : %s.

source: Coupon not valid for sale items.
ar: الكوبون غير صالح للعناصر المخفضة.
fr_fr: Coupon non valide pour les articles en promotion.

source: Coupon applied.
ar: تم تطبيق الكوبون.
fr_fr: Coupon appliqué.

source: Invalid request.
ar: طلب غير صالح.
fr_fr: Requête invalide.

source: Quick Checkout Settings
ar: إعدادات الدفع السريع
fr_fr: Réglages Quick Checkout

source: Quick Checkout
ar: الدفع السريع

source: Activation & Stats
ar: التفعيل والإحصائيات

source: Form Fields
ar: حقول النموذج
fr_fr: Champs du formulaire

source: Order & Integrations
ar: الطلب والتكاملات
fr_fr: Commande & Intégrations

source: Thank You
ar: الشكر
fr_fr: Remerciement

source: Tracking
ar: التتبع
fr_fr: Suivi

source: Statistics View
ar: عرض الإحصائيات
fr_fr: Vue des statistiques

source: Enable "Buy Now" Button
ar: تفعيل زر "اشترِ الآن"
fr_fr: Activer le bouton "Acheter maintenant"

source: Replaces Add to Cart with "Buy Now" for simple/variable products.
ar: يستبدل "أضف إلى السلة" بـ "اشترِ الآن" للمنتجات البسيطة/المتغيرة.
fr_fr: Remplace "Ajouter au panier" par "Acheter maintenant" pour les produits simples/variables.

source: "Buy Now" Button Text (Simple)
ar: نص زر "اشترِ الآن" (بسيط)
fr_fr: Texte du bouton "Acheter maintenant" (Simple)

source: Enable Popup Checkout
ar: تفعيل نافذة الدفع المنبثقة
fr_fr: Activer le popup de commande

source: Open checkout form in a popup on button click.
ar: فتح نموذج الدفع في نافذة منبثقة عند النقر على الزر.
fr_fr: Ouvre le formulaire de commande dans un popup au clic sur le bouton.

source: Enable Statistics Tracking
ar: تفعيل تتبع الإحصائيات
fr_fr: Activer le suivi des statistiques

source: Track button clicks and successful orders via popup.
ar: تتبع نقرات الزر والطلبات الناجحة عبر النافذة المنبثقة.
fr_fr: Suivre les clics sur le bouton et les commandes réussies via le popup.

source: Field Requirements
ar: الحقول المطلوبة
fr_fr: Champs requis

source: Default Payment Method
ar: طريقة الدفع الافتراضية
fr_fr: Moyen de paiement par défaut

source: Select the payment method for Quick Checkout orders.
ar: حدد طريقة الدفع لطلبات الدفع السريع.
fr_fr: Sélectionnez le moyen de paiement pour les commandes Quick Checkout.

source: Enable Google Sheets Sync
ar: تفعيل مزامنة جداول بيانات Google
fr_fr: Activer la synchro Google Sheets

source: Google Apps Script URL
ar: عنوان URL لبرنامج Google Apps النصي
fr_fr: URL Google Apps Script

source: Enter the Web App URL from Google Apps Script.
ar: أدخل عنوان URL لتطبيق الويب من برنامج Google Apps النصي.
fr_fr: Entrez l'URL de l'application Web depuis Google Apps Script.

source: Google Sheets Secret Key
ar: المفتاح السري لجداول بيانات Google
fr_fr: Clé secrète Google Sheets

source: Enter a secret key matching your Apps Script.
ar: أدخل مفتاحًا سريًا مطابقًا لبرنامج Apps النصي الخاص بك.
fr_fr: Entrez une clé secrète correspondant à votre Apps Script.

source: Confirmation Message
ar: رسالة التأكيد
fr_fr: Message de confirmation

source: Google Analytics ID (GA4: G-XXXX)
ar: معرف Google Analytics (GA4: G-XXXX)
fr_fr: ID Google Analytics (GA4 : G-XXXX)

source: Facebook Pixel ID
ar: معرف بيكسل فيسبوك
fr_fr: ID Pixel Facebook

source: You do not have sufficient permissions to access this page.
ar: ليس لديك الصلاحيات الكافية للوصول إلى هذه الصفحة.
fr_fr: Vous n'avez pas les permissions suffisantes pour accéder à cette page.

source: Save Settings
ar: حفظ الإعدادات
fr_fr: Enregistrer les réglages

source: Select which fields should be required in the popup form. Email field is currently removed.
ar: حدد الحقول التي يجب أن تكون مطلوبة في النموذج المنبثق. حقل البريد الإلكتروني محذوف حاليًا.
fr_fr: Sélectionnez les champs qui doivent être requis dans le formulaire popup. Le champ E-mail est actuellement supprimé.

source: View basic usage statistics for the Quick Checkout feature. Tracking must be enabled in the "Activation & Stats" tab.
ar: عرض إحصائيات الاستخدام الأساسية لميزة الدفع السريع. يجب تفعيل التتبع في علامة التبويب "التفعيل والإحصائيات".
fr_fr: Voir les statistiques d'utilisation basiques pour la fonction Quick Checkout. Le suivi doit être activé dans l'onglet "Activation & Stats".

source: Statistics tracking is currently disabled.
ar: تتبع الإحصائيات معطل حاليًا.
fr_fr: Le suivi des statistiques est actuellement désactivé.

source: Statistics module is not active or available.
ar: وحدة الإحصائيات ليست نشطة أو متاحة.
fr_fr: Le module de statistiques n'est pas actif ou disponible.

source: Form Field
ar: حقل النموذج
fr_fr: Champ du formulaire

source: Required?
ar: مطلوب؟
fr_fr: Requis ?

source: Name
ar: الاسم
fr_fr: Nom

source: Phone
ar: الهاتف
fr_fr: Téléphone

source: City
ar: المدينة
fr_fr: Ville

source: Address
ar: العنوان
fr_fr: Adresse

source: No payment gateways are currently available.
ar: لا توجد بوابات دفع متاحة حاليًا.
fr_fr: Aucune passerelle de paiement n'est actuellement disponible.

source: Internal Error: Could not validate item.
ar: خطأ داخلي: تعذر التحقق من العنصر.
fr_fr: Erreur interne : Impossible de valider l'article.

source: Item cannot be purchased.
ar: لا يمكن شراء العنصر.
fr_fr: L'article ne peut pas être acheté.

source: Not enough stock.
ar: المخزون غير كاف.
fr_fr: Stock insuffisant.

source: Could not initiate order.
ar: تعذر بدء الطلب.
fr_fr: Impossible d'initier la commande.

source: Coupon "%s" could not be applied. Reason: %s
ar: تعذر تطبيق الكوبون "%s". السبب: %s
fr_fr: Le coupon "%s" n'a pas pu être appliqué. Raison : %s

source: No suitable payment method available.
ar: لا توجد طريقة دفع مناسبة متاحة.
fr_fr: Aucun moyen de paiement approprié disponible.

source: Failed to save order data.
ar: فشل حفظ بيانات الطلب.
fr_fr: Échec de la sauvegarde des données de la commande.

source: Order via Quick Checkout.
ar: طلب عبر الدفع السريع.
fr_fr: Commande via Quick Checkout.

source: Google Sheets Web App URL is missing or invalid.
ar: عنوان URL لتطبيق ويب جداول بيانات Google مفقود أو غير صالح.
fr_fr: L'URL de l'application Web Google Sheets est manquante ou invalide.

source: Google Sheets Secret Key is not configured.
ar: المفتاح السري لجداول بيانات Google غير مهيأ.
fr_fr: La clé secrète Google Sheets n'est pas configurée.

source: Failed to prepare data for Google Sheets (JSON encode error).
ar: فشل إعداد البيانات لجداول بيانات Google (خطأ في ترميز JSON).
fr_fr: Échec de la préparation des données pour Google Sheets (erreur d'encodage JSON).

source: Could not connect to Google Sheets server:
ar: تعذر الاتصال بخادم جداول بيانات Google:
fr_fr: Impossible de se connecter au serveur Google Sheets :

source: Unknown error logging to the sheet.
ar: خطأ غير معروف أثناء التسجيل في الجدول.
fr_fr: Erreur inconnue lors de l'enregistrement dans la feuille.

source: Failed to send data to Google Sheets:
ar: فشل إرسال البيانات إلى جداول بيانات Google:
fr_fr: Échec de l'envoi des données à Google Sheets :

source: "Buy Now" Clicks Tracked
ar: نقرات "اشترِ الآن" المتتبعة
fr_fr: Clics "Acheter maintenant" suivis

source: Successful Orders via Popup
ar: الطلبات الناجحة عبر النافذة المنبثقة
fr_fr: Commandes réussies via Popup

source: Conversion Rate (Clicks to Orders)
ar: معدل التحويل (النقرات إلى الطلبات)
fr_fr: Taux de conversion (Clics vers Commandes)

source: Stats disabled, click not recorded
ar: الإحصائيات معطلة، لم يتم تسجيل النقرة
fr_fr: Stats désactivées, clic non enregistré

source: QCP Stat Track Success:
ar: QCP نجاح تتبع الإحصائيات:
fr_fr: QCP Succès Suivi Stat :

source: QCP Stat Track Server Response:
ar: QCP استجابة خادم تتبع الإحصائيات:
fr_fr: QCP Réponse Serveur Suivi Stat :

source: No message
ar: لا توجد رسالة
fr_fr: Pas de message

source: QCP Stat Track AJAX Error:
ar: QCP خطأ AJAX تتبع الإحصائيات:
fr_fr: QCP Erreur AJAX Suivi Stat :

source: Order Placed Successfully!
ar: تم تقديم الطلب بنجاح!
fr_fr: Commande passée avec succès !

source: Close
ar: إغلاق
fr_fr: Fermer

source: Processing your order...
ar: جاري معالجة طلبك...
fr_fr: Traitement de votre commande...

source: Loading...
ar: جاري التحميل...
fr_fr: Chargement...

source: Quantity
ar: الكمية
fr_fr: Quantité

source: Decrease quantity
ar: تقليل الكمية
fr_fr: Diminuer la quantité

source: Increase quantity
ar: زيادة الكمية
fr_fr: Augmenter la quantité

source: House number and street name
ar: رقم المنزل واسم الشارع
fr_fr: Numéro et nom de rue

source: Coupon code
ar: رمز الكوبون
fr_fr: Code promo

source: Confirm Your Order
ar: تأكيد طلبك
fr_fr: Confirmer votre commande

source: Order Summary
ar: ملخص الطلب
fr_fr: Résumé de la commande

source: Shipping Details
ar: تفاصيل الشحن
fr_fr: Détails de livraison

source: Fast Delivery available
ar: توصيل سريع متاح
fr_fr: Livraison rapide disponible

source: Payment upon receipt
ar: الدفع عند الاستلام
fr_fr: Paiement à la réception

source: Secure Checkout
ar: الدفع الآمن
fr_fr: Paiement sécurisé

source: Continue Shopping
ar: متابعة التسوق
fr_fr: Continuer les achats

source: Required.
ar: مطلوب.
fr_fr: Requis.

source: Error: Product info missing.
ar: خطأ: معلومات المنتج مفقودة.
fr_fr: Erreur : Informations produit manquantes.

source: Error finding selected variation.
ar: خطأ في العثور على التشكيلة المحددة.
fr_fr: Erreur lors de la recherche de la variation sélectionnée.

source: An unknown server error occurred.
ar: حدث خطأ غير معروف في الخادم.
fr_fr: Une erreur serveur inconnue s'est produite.

source: AJAX Error (
ar: خطأ AJAX (
fr_fr: Erreur AJAX (

source: ). Please try again.
ar: ). يرجى المحاولة مرة أخرى.
fr_fr: ). Veuillez réessayer.

source: Stats disabled or invalid ID
ar: الإحصائيات معطلة أو المعرف غير صالح
fr_fr: Stats désactivées ou ID invalide

source: Stats tracking call sent
ar: تم إرسال استدعاء تتبع الإحصائيات
fr_fr: Appel de suivi des stats envoyé

source: required
ar: مطلوب
fr_fr: requis

source: Product quantity
ar: كمية المنتج
fr_fr: Quantité du produit

source: Your Order
ar: طلبك
fr_fr: Votre commande

source: Enter your full name
ar: أدخل اسمك الكامل
fr_fr: Entrez votre nom complet

source: Enter your phone number
ar: أدخل رقم هاتفك
fr_fr: Entrez votre numéro de téléphone

source: Enter your town or city
ar: أدخل مدينتك
fr_fr: Entrez votre ville
